samplebilling.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:char="http://ChargingProcess/com/ibm/sdp/services/charging/abstraction/Charging">
	<soapenv:Header />
	<soapenv:Body>
		<char:charge>
			<inputMsg>
				<operation>${operation}</operation>
				<userId>${userid}</userId>
				<contentId>${contentid}</contentId>
				<itemName>${itemname}</itemName>
				<contentDescription>${contentDescription}</contentDescription>
				<circleId></circleId>
				<lineOfBusiness></lineOfBusiness>
				<customerSegment></customerSegment>
				<contentMediaType>${contentMediaType}</contentMediaType>
				<serviceId>${serviceId}</serviceId>
				<parentId></parentId>
				<actualPrice>${price}</actualPrice>
				<basePrice>${price}</basePrice>
				<discountApplied>0</discountApplied>
				<paymentMethod></paymentMethod>
				<revenuePercent></revenuePercent>
				<netShare>0</netShare>
				<cpId>${cpId}</cpId>
				<customerClass></customerClass>
				<eventType>${eventType}</eventType>
				<localTimeStamp></localTimeStamp>
				<transactionId>${transactionId}</transactionId>
				<subscriptionTypeCode>${subscriptionTypeCode}</subscriptionTypeCode>
				<subscriptionName>${subscriptionName}</subscriptionName>
				<parentType></parentType>
				<deliveryChannel>${deliveryChannel}</deliveryChannel>
				<subscriptionExternalId>0</subscriptionExternalId>
				<contentSize></contentSize>
				<currency>${currency}</currency>
				<copyrightId>${copyrightId}</copyrightId>
				<cpTransactionId>${cpTransactionId}</cpTransactionId>
				<copyrightDescription>${copyrightDescription}</copyrightDescription>
				<sMSkeyword>${sMSkeyword}</sMSkeyword>
				<srcCode>${srcCode}</srcCode>
				<contentUrl>${contentUrl}</contentUrl>
				<subscriptiondays>${subscriptiondays}</subscriptiondays>
			</inputMsg>
		</char:charge>
	</soapenv:Body>
</soapenv:Envelope>